
## Plan Result (envs/stg)

[CI link](https://github.com/uekiGityuto/terraform-expt/actions/runs/5455448309)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.ecs.aws_ecs_service.default
* Replace
  * module.ecs.aws_ecs_task_definition.default


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ecs.data.aws_ecs_task_definition.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "default" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "stg-terraform-expt"
      + task_role_arn        = (known after apply)
    }

  # module.ecs.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:ap-northeast-1:428485887053:service/stg-terraform-expt/stg-terraform-expt"
        name                               = "stg-terraform-expt"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:428485887053:task-definition/stg-terraform-expt:22" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.default must be replaced
-/+ resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:428485887053:task-definition/stg-terraform-expt:20" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:428485887053:task-definition/stg-terraform-expt" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  - essential        = true
                  - mountPoints      = []
                    name             = "app"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ]
        )
      ~ id                       = "stg-terraform-expt" -> (known after apply)
      ~ revision                 = 20 -> (known after apply)
      - tags                     = {} -> null
        # (8 unchanged attributes hidden)

      + runtime_platform { # forces replacement
          + cpu_architecture        = "ARM64" # forces replacement
          + operating_system_family = "LINUX" # forces replacement
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"ci","PRNumber":4,"Program":"tfcmt","SHA1":"ec7cf7fe507c98945f0a7f636bf756299c040fa4","Target":"envs/stg","Vars":{},"WorkflowName":"Terraform CI"} -->